[
    {
        "id": 0,
        "category": "About Dinosaurs",
        "content": {
            "id": 0,
            "image": "dinosaur1",
            "time": "3 hours",
            "description": "Understand the basics of Dinosaurs.",
            "lessons": [
                {
                    "id": 0,
                    "title": "Geological Eras",
                    "video": "A%20Brief%20History%20of%20Geologic%20Time%20-%20oDownloader.com.mp4",
                    "duration": "12 minutes",
                    "explanation": "The geologic tie scale, or geological time scale, (GTS) is a representation of time based on the rock record of Earth. It is a system of chronological dating that uses chronostratigraphy (the process of relating strata to time) and geochronology (scientific branch of geology that aims to determine the age of rocks). It is used primarily by Earth Scientists (including geologists, paleontologists, geophysicists, geochemists, and paleclimatologists) to describe the timing and relationships of events in geologic history. The time scale has been developed through the study of rock layers and the observation of their relationships and identifying features such as lithologies, paleomagnetic properties, and fossils. The definition of standardized international units of geologic time is the responsibility of the International Commission on Stratigraphy (ICS), a constituent body of the International Union of Geological Studies (IUGS), whose primary objective is to precisely define global chronostratigraphic units of the International Chronostratigraphic Chart (ICC) that are used to define divisions of geologic time. The chronostratigraphic divisions are in turn used to define geochronologic units."
                },
                {
                    "id": 1,
                    "title": "Physiology",
                    "video": "watch?v=MBFg32zaPCU",
                    "duration": "50 minutes",
                    "explanation": "Large dinosaurs may also have maintained their temperatures by inertial homeothermy, also known as bulk homeothermy or mass homeothermy. In other words, the thermal capacity of such large animals was so high that it would take two days or more for their temperatures to change significantly, and this would have smoothed out variations caused by daily temperature cycles. This smoothing effect has been observed in large turtles and crocodilians, but Plateosorus, which weighed about 700 kilograms (1,500 lb), may have been the smallest dinosaur in which it would have been effective. Inertial homeothermy would not have been possible for small species nor for the young of larger species. Vegetation fermenting in the guts of large herbivores can also produce considerable heat, but this method of maintaining a high and stable temperature would not have been possible for carnivores or for small herbivores or the young of larger herbivores. Since the internal mechanisms of extinct creatures are unknowable, most discussion focuses on homeothermy and tachymetabolism. Assessment of metabolic rates is complicated by the distinction between the rates while resting and while active. In all modern reptiles and most mammals and birds the maximum rates during all-out activity are 10 to 20 times higher than minimum rates while at rest. However, in a few mammals these rates differ by a factor of 70. Theoretically it would be possible for a land vertebrate to have a reptilian metabolic rate at rest and a bird-like rate while working flat out. However, an animal with such a low resting rate would be unable to grow quickly. The huge herbivorous sauropods may have been on the move so constantly in search of food that their energy expenditure would have been much the same irrespective of whether their resting metabolic rates were high or low."
                },
                {
                    "id": 2,
                    "title": "Why Feathers?",
                    "video": "watch?v=aOeFRg_1_Yg",
                    "duration": "17 minutes",
                    "explanation": "Today, feathers are found exclusively on birds. Even though we immediately associate bird feathers with flight, birds use feathers in over 20 ways (flight, lining nests, sledding, mating displays, etc.). And even though there are over 10,000 species on Earth today, around 60 of them can’t fly. So, what use for feathers do all of these birds have in common? The answer is body temperature regulation. From penguins to owls, to blue jays, to roadrunners, birds use feathers to keep them warm or cool as their environment demands. While most people have the notion that dinosaurs lived in jungles, plant fossils show us that most dinosaurs found in what is now North America lived in wooded areas, similar to what we might find today in Georgia, northern Florida, or the Carolinas. Feathers would have insulated them as temperatures warmed or cooled."
                },
                {
                    "id": 3,
                    "title": "Relative Speed",
                    "video": "watch?v=bs4BwEJglqY",
                    "duration": "5 minutes",
                    "explanation": "A good sequence of preserved footprints (called a trackway) can be extrapolated to give a rough estimate of how fast that particular animal was traveling at that moment. This method uses simple equations based on the distance between footfalls and the size of the feet. The fastest speeds evident from dinosaur tracks (a medium-sized theropod in this case) are about 12 meters per second (about 27 mph); a little faster than the best Olympic sprinters. Problem: It's hard to tell who made those tracks! We usually can narrow down our identification to large vs. small theropods, sauropods, or whatever. Then, knowing what sorts of those dinosaurs lived around there at the time the tracks were made, we can get ideas of who might have made those tracks. Then we have a shaky guess as to what dinosaur was moving at what speed at that instant. The obvious problem: At that instant is the key phrase; most animals are not running at top speed all of the time, especially when on soft ground, where tracks are most likely to be made. So we just have a glimpse into a brief moment in time; not a thorough analysis of dinosaur behavior. Good trackways are quite rare, too. But trackways are what we have to work with, so paleontologists must make do with that evidence."
                },
                {
                    "id": 4,
                    "title": "Plate Tectonics",
                    "video": "watch?v=DI6SemRT2iY",
                    "duration": "10 minutes",
                    "explanation": "Plate tectonics is the theory that Earth's outer shell is divided into large slabs of solid rock, called plates, that glide over Earth's mantle, the rocky inner layer above Earth’s core. Earth’s solid outer layer, which includes the crust and the uppermost mantle, is called the lithosphere."
                },
                {
                    "id": 5,
                    "title": "What is a Fossil?",
                    "video": "watch?v=bRuSmxJo_iA",
                    "duration": "4 minutes",
                    "explanation": "Fossils are the preserved remains, or traces of remains, of ancient organisms. Fossils are not the remains of the organism itself! They are rocks. A fossil can preserve an entire organism or just part of one. Bones, shells, feathers, and leaves can all become fossils. Fossils can be very large or very small. Microfossils are only visible with a microscope. Bacteria and pollen are microfossils. Macrofossils can be several meters long and weigh several tons. Macrofossils can be petrified trees or dinosaur bones. Preserved remains become fossils if they reach an age of about 10,000 years. Fossils can come from the Archaeaean Eon (which began almost 4 billion years ago) all the way up to the Holocene Epoch (which continues today). The fossilized teeth of wooly mammoths are some of our most recent fossils. Some of the oldest fossils are those of ancient algae that lived in the ocean more than 3 billion years ago. The word fossil comes from the Latin word fossus, meaning having been dug up. Fossils are often found in rock formations deep in the earth. Fossilization is the process of remains becoming fossils. Fossilization is rare. Most organisms decompose fairly quickly after they die. For an organism to be fossilized, the remains usually need to be covered by sediment soon after death. Sediment can include the sandy seafloor, lava, and even sticky tar. Over time, minerals in the sediment seep into the remains. The remains become fossilized. Fossilization usually occur in organisms with hard, bony body parts, such as skeletons, teeth, or shells. Soft-bodied organisms, such as worms, are rarely fossilized. Sometimes, however, the sticky resin of a tree can become fossilized. This is called fossilized resin or amber. Amber can preserve the bodies of many delicate, soft-bodied organisms, such as ants, flies, and mosquitoes. The fossils of bones, teeth, and shells are called body fossils. Most dinosaur fossils are collections of body fossils. Trace fossils are rocks that have preserved evidence of biological activity. They are not fossilized remains, just the traces of organisms. The imprint of an ancient leaf or footprint is a trace fossil. Burrows can also create impressions in soft rocks or mud, leaving a trace fossil. Paleontologists are people who study fossils. Paleontologists find and study fossils all over the world, in almost every environment, from the hot desert to the humid jungle. Studying fossils helps them learn about when and how different species lived millions of years ago. Sometimes, fossils tell scientists how the Earth has changed. Fossils of ancient marine animals called ammonites have been unearthed in the highest mountain range in the world, the Himalayas in Nepal. This tells scientists that millions of years ago, the rocks that became the Himalayas were at the bottom of the ocean. Fossils of an ancient giant shark, a megalodon, have been found in the landlocked U.S. state of Utah. This tells scientists that millions of years ago, the middle of North America was probably entirely underwater."
                },
                {
                    "id": 6,
                    "title": "Fundamentals of Cladistics",
                    "video": "results?search_query=introduction+to+cladistics",
                    "duration": "10 minutes",
                    "explanation": "This module provides a brief introduction to the philosophy, methodology, and implications of cladistic analysis. After you've read through the pages on the implications and methodologies, you will be armed in the ways of cladistics. Therefore, if you dare, you can take a journey into the real world of cladistics. Should you choose to venture on this journey, pray you are well-armed with good luck and wits! Cladistics is a particular method of hypothesizing relationships among organisms. Like other methods, it has its own set of assumptions, procedures, and limitations. Cladistics is now accepted as the best method available for phylogenetic analysis, for it provides an explicit and testable hypothesis of organismal relationships.The basic idea behind cladistics is that members of a group share a common evolutionary history, and are closely related, more so to members of the same group than to other organisms. These groups are recognized by sharing unique features which were not present in distant ancestors. These shared derived characteristics are called synapomorphies. Note that it is not enough for organisms to share characteristics, in fact two organisms may share a great many characteristics and not be considered members of the same group. For example, consider a jellyfish, starfish, and a human; which two are most closely related? The jellyfish and starfish both live in the water, have radial symmetry, and are invertebrates, so you might suppose that they belong together in a group. This would not reflect evolutionary relationships, however, since the starfish and human are actually more closely related. It is not just the presence of shared characteristics which is important, but the presence of shared derived characteristics. In the example above, all three characteristics are believed to have been present in the common ancestor of all animals, and so are trivial for determining relationships, since all three organisms in question belong to the group animals. While humans are different from the other two organisms, they differ only in characteristics which arose newly in an ancestor which is not shared with the other two. As you shall see on the next page, choosing the right characters is one of the most important steps in a cladistics analysis. There are three basic assumptions in cladistics: 1. Any group of organisms are related by descent from a common ancestor. 2. There is a bifurcating pattern of cladogenesis. 3. Change in characteristics occurs in lineages over time. The first assumption is a general assumption made for all evolutionary biology. It essentially means that life arose on earth only once, and therefore all organisms are related in some way or other. Because of this, we can take any collection of organisms and determine a meaningful pattern of relationships, provided we have the right kind of information. Again, the assumption states that all the diversity of life on earth has been produced through the reproduction of existing organisms. The second assumption is perhaps the most controversial; that is, that new kinds of organisms may arise when existing species or populations divide into exactly two groups. There are many biologists who hold that multiple new lineages can arise from a single originating population at the same time, or near enough in time to be indistinguishable from such an event. While this model could conceivably occur, it is not currently known how often this has actually happened. The other objection raised against this assumption is the possibility of interbreeding between distinct groups. This, however, is a general problem of reconstructing evolutionary history, and although it cannot currently be handled well by cladistic methods, no other system has yet been devised which accounts for it. The final assumption, that characteristics of organisms change over time, is the most important assumption in cladistics. It is only when characteristics change that we are able to recognize different lineages or groups. The convention is to call the original state of the characteristic plesiomorphic and the changed state apomorphic. The terms primitive and derived have also been used for these states, but they are often avoided by cladists, since those terms have been much abused in the past."
                },
                {
                    "id": 7,
                    "title": "Avian vs. Non-Avian",
                    "video": "watch?v=1KE9CiZIAII",
                    "duration": "3 minutes",
                    "explanation": "The term dinosaur is applied to a large group of animals that lived in vast areas of the earth over a long period beginning more than 230 million years ago. The dominance of the dinosaurs over the planet started after the occurrence of the Triassic–Jurassic extinction event. Much of the present-day information on dinosaurs comes from scientists studying fossils. Although the existence of the fossils was known for millennia, most communities did not understand what they were or attributed the fossils to mythical creatures such as dragons. The discovery of dinosaurs dates back to 1842. Scientific evidence indicates that there are two types of dinosaurs: avian and non-avian dinosaurs. There are several differences between avian and non-avian dinosaurs including their extinction, bone structure, and metabolic processes. One of the primary differences between avian and non-avian dinosaurs is that the latter became extinct after the occurrence of the Cretaceous–Paleogene extinction events which happened close to 66 million years ago while avian dinosaurs mostly survived and evolved into modern day birds. Some theories have been put forward to try and explain why a large number of the living species went extinct; however, most scientists are unable to reach a consensus on the cause. Despite the differing theories on the origins of the event, scientists agree on the impact which was the destruction of all non-avian dinosaurs which were thought to be around 1100 species. Some theories have tried to explain why avian dinosaurs were able to survive with one of the most famous being that they had larger brains than non-avian dinosaurs. Another possible theory suggested that avian dinosaurs were able to survive due to their diet. The nature of dinosaur's bones distinguished avian and non-avian dinosaurs as avian dinosaurs had hollow bones while non-avian dinosaurs had dense bones. Scientists have studied the dinosaur bones and they have found that although avian and non-avian dinosaur bones have some similarities, they are vastly different. The non-avian dinosaur bones evolved to support their tremendous weight and thus were exceptionally dense. Avian dinosaurs were reliant on the flight, and therefore their bones developed to allow them to fly. Avian and non-avian dinosaurs had different metabolic processes and the non-avian dinosaurs were cold-blooded while the avian dinosaurs were warm-blooded. Scientists are split on whether dinosaurs were cold-blooded or warm-blooded due to the difficulty in determining their exact physiology from fossil records. Most scientists are of the opinion that non-avian dinosaurs were cold-blooded although their large size enabled them to have a constant body temperature. Scientists find it easier to study the physiology of avian dinosaurs as many of their progeny have survived to the modern day."
                },
                {
                    "id": 8,
                    "title": "The Family Tree of Birds",
                    "video": "watch?v=uYUfMlgD5Wc",
                    "duration": "5 minutes",
                    "explanation": "Looking at the family tree of birds, there are three important aspects to keep in mind. First, early birds like Archaeopteryx are extremely similar in anatomy to advanced non-avian dinosaurs like Velociraptor. For example, both had long bony tails and teeth. Second, early in bird history, there were flying birds and non-flying birds. This great variety of forms included flightless diving animals like Hesperornis and small active flyers like Apsaravis. Third, birds, with many of the advanced features we consider to be characteristic of modern birds, lived at the same time as the non-avian dinosaurs. So the characters unique to birds must have evolved very early in the split from non-avian theropods. Before we continue, you may find it interesting to know that deciphering the family tree of animals at the transition from non-avian dinosaurs to birds is one of the hottest topics around. It is the focus of extensive efforts by scientists on many parts of the globe. Most investigators agree that small bipedal dinosaurs called troodontids and dromaeosaurs are the non-avian dinosaur groups most closely related to birds. These small dinosaurs have many things in common with modern birds and even more in common with primitive birds like Archaeopteryx. Linking Birds and Dinosaurs. To demonstrate that non-avian dinosaurs and birds are related, scientists needed fossils of both advanced dinosaurs and primitive birds to compare characters. But at the time Archaeopteryx was discovered, no good specimens of small, advanced dinosaurs had been found. When they were found at the end of the 20th century, they showed that, except for the relative length of the forelimb, there is very little difference between primitive birds like Archaeopteryx and advanced theropods like the dromaeosaur Velociraptor. Both have: wishbones, feathers, breastbones, wrists that contain a crescent-shaped bone, hands like most other advanced theropods, with three fingers in which the middle finger is the longest. Part of the reason that Archaeopteryx was so important is that for a long time it was the only well-preserved early bird fossil. All of that is now changed. As we speak, there are several newly found fossils that document transitional body plans from non-avian dinosaur to modern bird. The best way to look at these is from the perspective of a family tree. Moving up the genealogic ladder from Archaeopteryx to modern birds, the next early bird is Confuciosornis. This animal was found about six years ago. Now there are nearly a thousand specimens. Unlike Archaeopteryx, it lacks a long tail and has no teeth. Nevertheless, it still has three separate bones in its hand. Some Confuciusornis specimens preserve long tail feathers, like those of a bird of paradise. These feathers may represent the breeding plumage of males. After Confuciusornis there is a line of primitive birds that leads directly to modern birds. Included in this diversity from the Mesozoic era are birds like Hesperornis—a four-foot-tall water bird that lived about 70 million years ago in the seaway that bisected North America. Hesperornis could not fly, and it did have teeth. Another particularly interesting animal is Apsaravis, a small, robin-size flying bird from Mongolia. This little animal was an active flyer that undoubtedly flew above the heads and skittered around the feet of its non-avian dinosaur relatives. But the dominant group of birds that lived during the Mesozoic was the enantiornithines, otherwise known as “opposite birds.” These animals had an extensive distribution and diversity during the age of dinosaurs. Some of them even had teeth, some were probably good flyers, and others more closely resembled ground birds. The diversification of the kinds of birds that we see today occurred rather late in bird history. The first representatives of birds that belong to the modern groups are loons, grebes, and similar waterfowl, whose fossils have been found at the end of the Cretaceous, just before the non-avian dinosaurs became extinct. Archaeopteryx is the most primitive known bird and therefore most primitive known avian dinosaur. The first specimen was discovered in the 1850s, just about the same time that Charles Darwin published On the Origin of Species. This book was one of the most influential ever published in that it laid out the basic principles of evolution by natural selection. Darwin’s book stated that evolution was the great sum of small changes; in this way it predicted that transitional forms would be found between modern species. Archaeopteryx, as was immediately recognized by Thomas Huxley, was just one of these physical links between non-avian dinosaurs and birds. It was a close relative of birds in that it had a wishbone and a reversed first toe on its foot. (This is the toe that allows some birds to perch.) It also had feathers. Some of the feathers were asymmetric, meaning that the front edge of the feather was shorter than the back edge. Such feathers indicate that Archaeopteryx had some capacity for flight. Yet at the same time, it had many characteristics that are more primitive and more like non-avian theropods. For example, Archaeopteryx had a long bony tail similar to dromeosaurs, while in modern birds this tail is shortened and fused into the triangular piece called the pygostyle. Archaeopteryx also had teeth, three separate front fingers, and a breastbone that lacked a keel, like many non-avian theropods (except T. rex and oviraptorids). In modern birds, the teeth are lost, and the three fingers and the crescent-shaped bone in the wrist are all fused into a single bone in the hand."
                },
                {
                    "id": 9,
                    "title": "Our Shared History",
                    "video": "Try%20_%20Catch%20Basics%20-%20Swift%20Error%20Handling%20-%20Xcode%2010,%20Swift%204-9hb80LAwf5c.mp4",
                    "duration": "17 minutes",
                    "explanation": "Dinosaurs10 are epic as fuck. Dinosaurs are epic as fuck. Dinosaurs are epic as fuck. Dinosaurs are epic as fuck. Dinosaurs are epic as fuck. Dinosaurs are epic as fuck. Dinosaurs are epic as fuck. Dinosaurs are epic as fuck. Dinosaurs are epic as fuck. Dinosaurs are epic as fuck. Dinosaurs are epic as fuck. Dinosaurs are epic as fuck. Dinosaurs are epic as fuck. Dinosaurs are epic as fuck. Dinosaurs are epic as fuck. Dinosaurs are epic as fuck. Dinosaurs are epic as fuck. Dinosaurs are epic as fuck. Dinosaurs are epic as fuck. Dinosaurs are epic as fuck. Dinosaurs are epic as fuck. Dinosaurs are epic as fuck. Dinosaurs are epic as fuck. Dinosaurs are epic as fuck. Dinosaurs are epic as fuck. Dinosaurs are epic as fuck. Dinosaurs are epic as fuck. Dinosaurs are epic as fuck. Dinosaurs are epic as fuck. Dinosaurs are epic as fuck. Dinosaurs are epic as fuck. Dinosaurs are epic as fuck. Dinosaurs are epic as fuck. Dinosaurs are epic as fuck. Dinosaurs are epic as fuck. Dinosaurs are epic as fuck. Dinosaurs are epic as fuck. Dinosaurs are epic as fuck. Dinosaurs are epic as fuck. Dinosaurs are epic as fuck. Dinosaurs are epic as fuck. Dinosaurs are epic as fuck. Dinosaurs are epic as fuck. Dinosaurs are epic as fuck. Dinosaurs are epic as fuck. Dinosaurs are epic as fuck. Dinosaurs are epic as fuck."
                }
            ]
        },
        "test": {
            "id": 0,
            "image": "dinosaur2",
            "time": "30 minutes",
            "description": "Gear up and put your Dinosaur knowledge to the test.",
            "questions": [
                {
                    "id": 0,
                    "content": "<p>What keyword is used to define a constant in Swift?</p>",
                    "correctIndex": 2,
                    "answers": [
                        "const",
                        "var",
                        "let",
                        "const var"
                    ]
                },
                {
                    "id": 1,
                    "content": "<p>How large is an Int?</p>",
                    "correctIndex": 3,
                    "answers": [
                        "16 bits",
                        "32 bits",
                        "64 bits",
                        "It depends on the platform"
                    ]
                },
                {
                    "id": 2,
                    "content": "<p>What is the value of <span class='pre'>b</span> in the following expression?</p><div class='highlight-swift notranslate'><div class='code-sample'><div class='Swift highlight'><ol class='code-lines'><li><span class='k'>let</span> <span class='nv'>a</span> = <span class='k'>false</span></li><li><span class='k'>let</span> <span class='nv'>b</span> = <span class='k'>false</span> || ( <span class='k'>true</span> && !<span class='k'>a</span> )</li></ol></div></div></div>",
                    "correctIndex": 0,
                    "answers": [
                        "true",
                        "false"
                    ]
                },
                {
                    "id": 3,
                    "content": "<p>What is the type and value of str in the following expression?</p><div class='highlight-swift notranslate'><div class='code-sample'><div class='Swift highlight'><ol class='code-lines'><li><span class='k'>let</span> <span class='nv'>num</span> = <span class='m'>12.0</span></li><li><span class='k'>let</span> <span class='nv'>str</span> = <span class='nv'>String</span>(<span class='nv'>num</span>)</li></ol></div></div></div>",
                    "correctIndex": 1,
                    "answers": [
                        "Type: String, Value: \"12.0\"",
                        "Type: String?, Value: \"12.0\"",
                        "Type: String, Value: \"12\"",
                        "Type: String?, Value: nil"
                    ]
                },
                {
                    "id": 4,
                    "content": "<p>What operator takes two numbers, and returns a boolean?</p>",
                    "correctIndex": 4,
                    "answers": [
                        "<",
                        ">",
                        "==",
                        "!=",
                        "all of the above"
                    ]
                },
                {
                    "id": 5,
                    "content": "<p>What does the following code output?</p><div class='highlight-swift notranslate'><div class='code-sample'><div class='Swift highlight'><ol class='code-lines'><li><span class='k'>let</span> <span class='nv'>total</span> = <span class='m'>0</span></li><li><span class='k'>let</span> <span class='nv'>nums</span> = [<span class='m'>0</span>, <span class='m'>1</span>, <span class='m'>2</span>, <span class='m'>3</span>]</li><li><span class='k'>for</span> <span class='nv'>num</span> <span class='k'>in</span> <span class='nv'>nums</span> {</li><li><span class='nv'>total</span> += <span class='nv'>num</span></span></li><li>}</li>",
                    "correctIndex": 2,
                    "answers": [
                        "0",
                        "3",
                        "6",
                        "10"
                    ]
                },
                {
                    "id": 6,
                    "content": "<p>What is the following function's return type?</p><div class='highlight-swift notranslate'><div class='code-sample'><div class='Swift highlight'><ol class='code-lines'><li><span class='k'>func</span> <span class='nv'>foo</span>(<span class='nv'>bar</span>: <span class='nc'>String</span>, <span class='nv'>bizz</span>: <span class='nc'>Bool</span>) -&gt; <span class='nc'>Int</span> {...}</li></ol></div></div></div>",
                    "correctIndex": 2,
                    "answers": [
                        "String",
                        "Bool",
                        "Int",
                        "It doesn't have a return type"
                    ]
                },
                {
                    "id": 7,
                    "content": "Structures can't:",
                    "correctIndex": 3,
                    "answers": [
                        "Define properties to store values",
                        "Define initializers to set up their initial state",
                        "Conform to protocols to provide standard functionality of a certain kind",
                        "Inherit the characteristics of another structure"
                    ]
                },
                {
                    "id": 8,
                    "content": "Why might you throw an error?",
                    "correctIndex": 1,
                    "answers": [
                        "The code has become too complicated to continue writing",
                        "Something unexpected happened and the normal flow of execution can't continue",
                        "To pass data to a caller method"
                    ]
                },
                {
                    "id": 9,
                    "content": "How can you deal with an error?",
                    "correctIndex": 3,
                    "answers": [
                        "By correcting the problem",
                        "By trying an alternative approach",
                        "By informing the user of the failure",
                        "All of the above"
                    ]
                }
            ]
        }
    }
]
